rocksdb/experiments/M2/results/20260429-025838/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 03:02:12 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777431732747111 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.551 micros/op 116942 ops/sec 42.756 seconds 5000000 operations;  116.0 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      13.179 micros/op 75879 ops/sec 65.894 seconds 5000000 operations;   75.3 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      15.170 micros/op 65918 ops/sec 75.852 seconds 5000000 operations;   65.4 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   186.83 MB   0.8      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    566.0     26.41             20.53       240    0.110       0      0       0.0       0.0
  L1     28/1    1.79 GB   6.9     27.1    14.4     12.7      23.8     11.1       0.0   1.7    244.1    214.6    113.57             97.51        19    5.977     27M  3327K       0.0       0.0
  L2     92/2    4.49 GB   1.8     20.3     8.8     11.5      15.4      3.9       0.6   1.8    307.9    234.1     67.46             57.21       133    0.507     20M  4951K       0.0       0.0
 Sum    123/3    6.46 GB   0.0     47.4    23.2     24.2      53.8     29.7       0.6   3.7    233.8    265.7    207.45            175.25       392    0.529     48M  8279K       0.0       0.0
 Int      0/0    0.00 KB   0.0     47.1    23.0     24.2      53.2     29.1       0.6   3.7    234.9    265.3    205.42            173.71       385    0.534     47M  8275K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.4    23.2     24.2      39.2     15.1       0.0   0.0    267.9    221.9    181.04            154.72       152    1.191     48M  8279K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    566.0     26.41             20.53       240    0.110       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 184.5 total, 181.5 interval
Flush(GB): cumulative 14.598, interval 14.233
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.82 GB write, 298.69 MB/s write, 47.36 GB read, 262.83 MB/s read, 207.4 seconds
Interval compaction: 53.22 GB write, 300.23 MB/s write, 47.12 GB read, 265.82 MB/s read, 205.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 23, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 23, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 23, total-stops: 0
interval: 23 total count
Block cache LRUCache@0x5609f8178df0#80356 capacity: 32.00 MB seed: 319486823 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000168 secs_since: 184
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 184.5 total, 181.5 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 81.87 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 81.87 MB/s
Cumulative stall: 00:01:5.596 H:M:S, 35.6 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14692.97 MB, 80.95 MB/s
Interval WAL: 14M writes, 0 syncs, 14589671.00 writes per sync, written: 14.35 GB, 80.95 MB/s
Interval stall: 00:01:5.596 H:M:S, 36.1 percent
Write Stall (count): write-buffer-manager-limit-stops: 0